{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<s>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "</s>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "</s>": {
        "id": "</s>",
        "ids": [
          3
        ],
        "tokens": [
          "</s>"
        ]
      },
      "<s>": {
        "id": "<s>",
        "ids": [
          2
        ],
        "tokens": [
          "<s>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<pad>": 0,
      "<unk>": 1,
      "<s>": 2,
      "</s>": 3,
      "[C]": 4,
      "[Branch2]": 5,
      "[Ring1]": 6,
      "[=Branch2]": 7,
      "[S]": 8,
      "[=N]": 9,
      "[N]": 10,
      "[Branch1]": 11,
      "[=C]": 12,
      "[Cl]": 13,
      "[#Branch1]": 14,
      "[=Branch1]": 15,
      "[=S]": 16,
      "[=O]": 17,
      "[O]": 18,
      "[Ring2]": 19,
      "[/C]": 20,
      "[/O]": 21,
      "[NH1]": 22,
      "[C@@]": 23,
      "[P]": 24,
      "[C@@H1]": 25,
      "[F]": 26,
      "[#Branch2]": 27,
      "[C@H1]": 28,
      "[#C]": 29,
      "[C@]": 30,
      "[=N+1]": 31,
      "[N+1]": 32,
      "[Br]": 33,
      "[#N]": 34,
      "[I]": 35,
      "[/N]": 36,
      "[=Ring1]": 37,
      "[\\C]": 38,
      "[O-1]": 39,
      "[=Ring2]": 40,
      "[/C@H1]": 41,
      "[=Si]": 42,
      "[\\S]": 43,
      "[N@+1]": 44,
      "[\\O]": 45,
      "[PH1]": 46,
      "[P@@]": 47,
      "[\\N]": 48,
      "[=P]": 49,
      "[=S+1]": 50,
      "[18F]": 51,
      "[P+1]": 52,
      "[-/Ring2]": 53,
      "[S+1]": 54,
      "[B]": 55,
      "[/S]": 56,
      "[\\N+1]": 57,
      "[\\NH1]": 58,
      "[OH0]": 59,
      "[/C@@]": 60,
      "[\\C@H1]": 61,
      "[\\F]": 62,
      "[/C@@H1]": 63,
      "[C-1]": 64,
      "[#N+1]": 65,
      "[Si]": 66,
      "[=N-1]": 67,
      "[/N+1]": 68,
      "[\\P]": 69,
      "[/C@]": 70,
      "[/Br]": 71,
      "[11CH3]": 72,
      "[/NH1]": 73,
      "[17F]": 74,
      "[N-1]": 75,
      "[BH2-1]": 76,
      "[/I]": 77,
      "[\\C@@H1]": 78,
      "[CH1-1]": 79,
      "[N@@+1]": 80,
      "[125I]": 81,
      "[3H]": 82,
      "[\\Cl]": 83,
      "[S@+1]": 84,
      "[S@@+1]": 85,
      "[-\\Ring2]": 86,
      "[\\O-1]": 87,
      "[B-1]": 88,
      "[#C-1]": 89,
      "[/Cl]": 90,
      "[\\I]": 91,
      "[/123I]": 92,
      "[\\C@@]": 93,
      "[/F]": 94,
      "[/P]": 95,
      "[P@]": 96,
      "[123I]": 97,
      "[124I]": 98,
      "[-\\Ring1]": 99,
      "[\\Br]": 100,
      "[/B]": 101,
      "[=P@]": 102,
      "[#S]": 103,
      "[/O-1]": 104,
      "[S@]": 105,
      "[=PH1]": 106,
      "[S@@]": 107,
      "[-/Ring1]": 108,
      "[=O+1]": 109,
      "[P@+1]": 110,
      "[\\125I]": 111,
      "[=P@@]": 112,
      "[\\S+1]": 113,
      "[O+1]": 114,
      "[/S+1]": 115,
      "[C+1]": 116,
      "[/Si]": 117,
      "[\\B]": 118,
      "[CH0]": 119,
      "[/125I]": 120,
      "[\\C@]": 121,
      "[NH0]": 122,
      "[SH1]": 123,
      "[=S@]": 124,
      "[CH1]": 125,
      "[=SH1]": 126,
      "[=S@@]": 127,
      "[BH1-1]": 128,
      "[SH0]": 129,
      "[\\PH1]": 130,
      "[#O+1]": 131,
      "[SH2]": 132,
      "[\\123I]": 133,
      "[P@@+1]": 134,
      "[BH3-1]": 135,
      "[/PH1]": 136,
      "[=PH2]": 137,
      "[\\Si]": 138,
      "[CH2]": 139,
      "[127I]": 140,
      "[/C-1]": 141,
      "[\\3H]": 142,
      "[\\CH1-1]": 143,
      "[/N-1]": 144,
      "[\\C-1]": 145,
      "[18OH1]": 146,
      "[=B]": 147,
      "[B@@-1]": 148,
      "[/P+1]": 149,
      "[B@-1]": 150,
      "[/P@@]": 151
    },
    "unk_token": "<unk>"
  }
}